SpenceKonde/ATTinyCore/avr/cores/tiny/Arduino.h
#ifndef Arduino_h
#define Arduino_h

#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <math.h>

#include <avr/pgmspace.h>
#include <avr/io.h>
#include <avr/interrupt.h>

#include "binary.h"

#ifdef __cplusplus
extern "C"{
#endif

#define ATTINY_CORE 1
#ifndef _NOPNOP
  #define _NOPNOP() do { __asm__ volatile ("rjmp .+0"); } while (0)
#endif


#define HIGH 0x1
#define LOW  0x0

#define INPUT 0x0
#define OUTPUT 0x1
#define INPUT_PULLUP 0x2


#define PI 3.1415926535897932384626433832795
#define HALF_PI 1.5707963267948966192313216916398
#define TWO_PI 6.283185307179586476925286766559
#define DEG_TO_RAD 0.017453292519943295769236907684886
#define RAD_TO_DEG 57.295779513082320876798154814105

#define SERIAL  0x0
#define DISPLAY 0x1

#define LSBFIRST 0
#define MSBFIRST 1

#define CHANGE 1
#define FALLING 2
#define RISING 3

#define NOT_AN_INTERRUPT -1

#define min(a,b) \
  ({ __typeof__ (a) _a = (a); \
    __typeof__ (b) _b = (b); \
    _a < _b ? _a : _b; })

#define max(a,b) \
  ({ __typeof__ (a) _a = (a); \
    __typeof__ (b) _b = (b); \
    _a > _b ? _a : _b; })

#ifndef constrain
#define constrain(x,low,high)   ({ \
  typeof (x) _x = (x);             \
  typeof (low) _l = (l);           \
  typeof (high) _h = (h);          \
  _x < _l ? _l : _x > _h ? _h :_x })
#endif

#ifndef radians
#define radians(deg) ((deg)*DEG_TO_RAD)
#endif

#ifndef degrees
#define degrees(rad) ((rad)*RAD_TO_DEG)
#endif

#ifndef sq
#define sq(x)        ({ typeof (x) _x = (x); _x * _x; })
#endif

#ifndef round
#define round(x)     ({ typeof (x) _x = (x);  _x >= 0 ? (long)x + 0.5 : (long)x - 0.5 })
#endif

#define interrupts() sei()
#define noInterrupts() cli()

#if F_CPU < 1000000L
//Prevent a divide by 0 is
#warning "Clocks per microsecond < 1. To prevent divide by 0, it is rounded up to 1."

#define clockCyclesPerMicrosecond() 1UL
#else
#define clockCyclesPerMicrosecond() (F_CPU / 1000000UL)
#endif

//#define clockCyclesToMicroseconds(a) (((a) * 1000L) / (F_CPU / 1000L))
//#define microsecondsToClockCycles(a) (((a) * (F_CPU / 1000L)) / 1000L)

#define clockCyclesToMicroseconds(a) ((a) / clockCyclesPerMicrosecond())
#define microsecondsToClockCycles(a) ((a) * clockCyclesPerMicrosecond())

#define lowByte(w) ((uint8_t) ((w) & 0xff))
#define highByte(w) ((uint8_t) ((w) >> 8))

#define bitRead(value, bit) (((value) >> (bit)) & 0x01)
#define bitSet(value, bit) ((value) |= (1UL << (bit)))
#define bitClear(value, bit) ((value) &= ~(1UL << (bit)))
#define bitWrite(value, bit, bitvalue) (bitvalue ? bitSet(value, bit) : bitClear(value, bit))


typedef unsigned int word;

#define bit(b) (1UL << (b))

typedef uint8_t boolean;
typedef uint8_t byte;

void initToneTimer(void);
void init(void);

void pinMode(uint8_t pinNumber, uint8_t mode);
void digitalWrite(uint8_t pinNumber, uint8_t val);
void digitalWriteFast(uint8_t pinNumber, uint8_t val);
int8_t digitalRead(uint8_t pinNumber);
int8_t digitalReadFast(uint8_t pinNumber);
int analogRead(uint8_t pinNumber);
void analogReference(uint8_t mode);
void analogWrite(uint8_t pinNumber, int16_t val);
void turnOffPWM(uint8_t pin);

unsigned long millis(void);
unsigned long micros(void);

void yield(void);
void delay(unsigned long);
void delayMicroseconds(unsigned int us);

unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout);
unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout);

void shiftOut(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder, uint8_t val);
uint8_t shiftIn(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder);

void attachInterrupt(uint8_t, void (*)(void), int mode);
void detachInterrupt(uint8_t);

void setup(void);
void loop(void);

// Compile-time error checking functions

void badArg(const char*) __attribute__((error("")));
void badCall(const char*) __attribute__((error("")));

inline __attribute__((always_inline)) void check_constant_pin(pin_size_t pin)
{
  if(!__builtin_constant_p(pin))
    badArg("Fast digital pin must be a constant");
}




// Get the bit location within the hardware port of the given virtual pin.
// This comes from the pins_*.c file for the active board configuration.

extern const uint16_t PROGMEM port_to_mode_PGM[];
extern const uint16_t PROGMEM port_to_input_PGM[];
extern const uint16_t PROGMEM port_to_output_PGM[];

extern const uint8_t PROGMEM digital_pin_to_port_PGM[];
extern const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[];
extern const uint8_t PROGMEM digital_pin_to_timer_PGM[];

// Get the bit location within the hardware port of the given virtual pin.
// This comes from the pins_*.c file for the active board configuration.
// These perform slightly better as macros compared to inline functions

#define const_array_or_pgm_(FUNC,ARR,IDX) ({size_t idx_ = (IDX); __builtin_constant_p((ARR)[idx_]) ? (ARR)[idx_] : FUNC((ARR)+idx_); })
#define digitalPinToPort(P) (const_array_or_pgm_(pgm_read_byte, digital_pin_to_port_PGM, (P)))
#define digitalPinToBitMask(P) (const_array_or_pgm_(pgm_read_byte, digital_pin_to_bit_mask_PGM, (P)))
#define digitalPinToTimer(P) (const_array_or_pgm_(pgm_read_byte, digital_pin_to_timer_PGM, (P)))
#define analogInPinToBit(P) (P)
#define portOutputRegister(P) ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_word, port_to_output_PGM, (P))))
#define portInputRegister(P) ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_word, port_to_input_PGM, (P))))
#define portModeRegister(P) ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_word, port_to_mode_PGM, (P))))

// Ooof - if anyone actually cared about the ATtiny828, we could get rid of all those arrays and save a bunch of flash space, because the rational pin layout is beautiful...
// But I don't think anyone does anymore, if they even ever did. I am more convinced than ever that something went horribly wrong during the design process, leading to the 828
// being released... as it is. I think it was going to have the ADC that the 841 has, only with more pins on it. That would have been an analog-to-digital sledgehammer... but alas!

#define NOT_A_PIN 255
#define NOT_A_PORT 0

#define PA 1
#define PB 2
#define PC 3
#define PD 4

#define NOT_ON_TIMER 0
#define TIMER0A 1
#define TIMER0B 2
#define TIMER1A 3
#define TIMER1B 4
#define TIMER2A 5
#define TIMER2B 6
#define TIMER1D 7
#define TOCC0  (0x80)

#define TIM1AU (0x08)
#define TIM1AV (0x09)
#define TIM1AW (0x0A)
#define TIM1AX (0x0B)
#define TIM1BU (0x0C)
#define TIM1BV (0x0D)
#define TIM1BW (0x0E)
#define TIM1BX (0x0F)


#include "pins_arduino.h"

#ifndef USE_SOFTWARE_SERIAL
  //Default to hardware serial.
  #define USE_SOFTWARE_SERIAL 0
#endif

/*=============================================================================
  Allow the ADC to be optional for low-power applications
=============================================================================*/

#ifndef TIMER_TO_USE_FOR_MILLIS
  #define TIMER_TO_USE_FOR_MILLIS                     0
#endif
/*
  Tone goes on whichever timer was not used for millis.
*/
#if TIMER_TO_USE_FOR_MILLIS == 1
  #define TIMER_TO_USE_FOR_TONE                     0
#else
  #define TIMER_TO_USE_FOR_TONE                     1
#endif

#if NUM_ANALOG_INPUTS > 0
  #define HAVE_ADC                  1
  #ifndef INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER
    #define INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER   1
  #endif
#else
  #define HAVE_ADC                0
  #if defined(INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER)
    #undef INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER
  #endif
  #define INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER  0
#endif

#if !HAVE_ADC
  #undef INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER
  #define INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER  0
#else
  #ifndef INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER
    #define INITIALIZE_ANALOG_TO_DIGITAL_CONVERTER   1
  #endif
#endif

/*=============================================================================
  Allow the "secondary timers" to be optional for low-power applications
=============================================================================*/

#ifndef INITIALIZE_SECONDARY_TIMERS
  #define INITIALIZE_SECONDARY_TIMERS               1
#endif


#ifdef __cplusplus
} // extern "C"
#endif

#ifdef __cplusplus
#include "WCharacter.h"
#include "WString.h"
#include "HardwareSerial.h"
#include "TinySoftwareSerial.h"

uint16_t makeWord(uint16_t w);
uint16_t makeWord(byte h, byte l);

#define word(...) makeWord(__VA_ARGS__)

unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);
unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);

void tone(uint8_t _pin, unsigned long frequency, unsigned long duration = 0);
void noTone(uint8_t _pin = 255);

// WMath prototypes
long random(long);
long random(long, long);
void randomSeed(unsigned int);
long map(long, long, long, long, long);

#endif

/*=============================================================================
  Aliases for the interrupt service routine vector numbers so the code
  doesn't have to be riddled with #ifdefs.
=============================================================================*/

#ifndef SIGRD
#define SIGRD 5
#endif


#if defined(TIM0_CAPT_vect)   && !defined(TIMER0_CAPT_vect)
#define TIMER0_CAPT_vect TIM0_CAPT_vect
#endif

#if defined(TIM0_COMPA_vect)  && !defined(TIMER0_COMPA_vect)
#define TIMER0_COMPA_vect TIM0_COMPA_vect
#endif

#if defined(TIM0_COMPB_vect)  && !defined(TIMER0_COMPB_vect)
#define TIMER0_COMPB_vect TIM0_COMPB_vect
#endif

#if defined(TIM0_OVF_vect)    && !defined(TIMER0_OVF_vect)
#define TIMER0_OVF_vect TIM0_OVF_vect
#endif

#if defined(TIM1_CAPT_vect)   && !defined(TIMER1_CAPT_vect)
#define TIMER1_CAPT_vect TIM1_CAPT_vect
#endif

#if defined(TIM1_COMPA_vect)  && !defined(TIMER1_COMPA_vect)
#define TIMER1_COMPA_vect TIM1_COMPA_vect
#endif

#if defined(TIM1_COMPB_vect)  && !defined(TIMER1_COMPB_vect)
#define TIMER1_COMPB_vect TIM1_COMPB_vect
#endif

#if defined(TIM1_OVF_vect)    && !defined(TIMER1_OVF_vect)
#define TIMER1_OVF_vect TIM1_OVF_vect
#endif

#if defined(TIM2_CAPT_vect)   && !defined(TIMER2_CAPT_vect)
#define TIMER2_CAPT_vect TIM2_CAPT_vect
#endif

#if defined(TIM2_COMPA_vect)  && !defined(TIMER2_COMPA_vect)
#define TIMER2_COMPA_vect TIM2_COMPA_vect
#endif

#if defined(TIM2_COMPB_vect)  && !defined(TIMER2_COMPB_vect)
#define TIMER2_COMPB_vect TIM2_COMPB_vect
#endif

#if defined(TIM2_OVF_vect)    && !defined(TIMER2_OVF_vect)
#define TIMER2_OVF_vect TIM2_OVF_vect
#endif


#endif
